# FinishedStreams Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
DocumentSaveToLocalProgressChangedEventArgs..::..FinishedStreams Property
DocumentSaveToLocalProgressChangedEventArgs Class See Also
---
The number of streams finished since the last time this event was raised.
**Namespace:** Autodesk.Revit.DB.Events**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017 Subscription Update
# Syntax
C#
---
```text
public int FinishedStreams { get; }
```

Visual Basic
---
```text
Public ReadOnly Property FinishedStreams As Integer
	Get
```

Visual C++
---
```text
public:
property int FinishedStreams {
	int get ();
}
```

# See Also
DocumentSaveToLocalProgressChangedEventArgs Class
Autodesk.Revit.DB.Events Namespace